import images from "./Images";

export const exhibitionsList = [
  {
    id: "1",
    city: "Москва",
    category: "Выставки",
    image: images.event1,
    name: "Стихи о цветах #1",
    description: "На выставке вы окунетесь в атмосферу цветов и поэзии, где каждый образ и стихотворение переносят вас в удивительный мир цветочных садов, загадочных лесов и манящих ароматов. Интерактивные зоны и творческие уголки позволят вам прочувствовать каждую ноту поэзии, каждый оттенок цвета и каждый аккорд природы",
    address: "Парк Искусств, ул. Цветочная, 7",
    date: "Май 6",
    timeStart: "10:00",
    timeEnd: "20:00",
    cost: "900",
    contact: "89249272018"
  }
];
export const lecturesList = [
  {
    id: "1",
    city: "Москва",
    category: "Лекции",
    image: images.event2,
    name: "Отсутствие головы - символ Победы",
    description: "На выставке вы научитесь воспринимать искусство исключительно через символику и образы, раскрывая скрытые глубины смысла и силу выражения без лишних слов. Исследование этой темы призвано углубить ваш взгляд на искусство и культуру, открыв новые перспективы в восприятии творчества и мировосприятии",
    address: "Галерея Современного Искусства, ул. Белорусская, 15",
    date: "Май 26",
    timeStart: "09:00",
    timeEnd: "18:00",
    cost: "1200",
    contact: "89283743901"
  },
  {
    id: "2",
    city: "Санкт-Петербург",
    category: "Лекции",
    image: images.event3,
    name: "Мотивы голландских натюрмортов",
    description: "Погрузитесь в мир изысканных и утонченных мотивов голландских натюрмортов на уникальной выставке. Искусство раскрывается здесь во всей своей красе и многогранности, приглашая вас в увлекательное путешествие по эстетике и философии",
    address: "Галерея Искусств, ул. Добровольского, 25Э",
    date: "Июнь 3",
    timeStart: "11:00",
    timeEnd: "19:00",
    cost: "1300",
    contact: "89928337464"
  }
];
export const classesList = [
  {
      id: "1",
      city: "Санкт-Петербург",
      category: "Мастер-классы",
      image: images.event4,
      name: "Креативность и формирование объема",
      description: "Погрузитесь в уникальный мир креативности и формирования объема на этой захватывающей выставке. Узнайте, как художники из разных уголков мира воплощают свои идеи в пространстве и создают удивительные объемные произведения. Путешествие по этой экспозиции раскроет перед вами удивительные возможности творческого мышления и воплощения идей в реальность",
      address: "Галерея Искусств, ул. Просторная, 10",
      date: "Июнь 1",
      timeStart: "09:00",
      timeEnd: "11:00",
      cost: "1000",
      contact: "89893404728"
  },
  {
      id: "2",
      city: "Санкт-Петербург",
      category: "Мастер-классы",
      image: images.event5,
      name: "Техника масляной живописи",
      description: "Погрузитесь в мир изысканного искусства масляной живописи на уникальной выставке. Откройте перед собой мир красок, текстур и глубины, воплощенных мастерами в знаменитой технике масляной живописи. Каждое произведение на этой выставке несет в себе частичку творческой души и мастерства, приглашая зрителя окунуться в волшебный мир художественных образов",
      address: "Галерея Современного Искусства, ул. Моторная, 17",
      date: "Июнь 8",
      timeStart: "10:00",
      timeEnd: "12:00",
      cost: "900",
      contact: "89024487836"
  }
]
